# Цель работы: Решение школьных математических задач с numpy
# Дано число  s = 100i + j.
# import random
# random.seed(s)
# Дана задача:
# Есть 100 лесорубов. Каждый из них рубит лес, при этом в день может вырубить random.randint(1,3) деревьев. Каждого из них нужно кормить в рабочее время. При этом он съедает random.randint(500, 1000)г еды в день. Кроме того, он выпивает random.randint(2,3)л воды в день. При этом у них разная выносливость и они могут работать random.randint(4,6) дней в неделю.
# Вопрос. Сколько еды, воды надо на них заготовить в неделю, сколько деревьев они могут срубить за неделю.
# Важно: Каждый параметр определять отдельно в порядке, в котором они указаны в задаче: сначала количество деревьев для каждого лесоруба, потом еду и т.д. (чтобы получить правильные значения)
# Примечание: Задачу решать, создав матрицу лесорубов (100 лесорубов x4 параметра) в numpy и делая необходимые преобразования.
