# i=7 Номер группы
# j=1 Номер бригады
import math

A = (7, 5)
B = (8, 6)
C = (10, 8)
print("Координаты точки в формате (x,y)"
      "\nКоординаты точки А", A,
      "\nКоординаты точки B", B,
      "\nКоординаты точки C", C)
print()
# Рассчитаем стороны по формуле рсстояния от точки до прямой или же длины вектора
AB = math.sqrt(((B[0] - A[0]) ** 2) + ((B[1] - A[1]) ** 2))
AC = math.sqrt(((C[0] - A[0]) ** 2) + ((C[1] - A[1]) ** 2))
BC = math.sqrt(((C[0] - B[0]) ** 2) + ((C[1] - B[1]) ** 2))
print("Длина стороны AB", int(AB),
      "\nДлина стороны AC", int(AC),
      "\nДлина стороны BC", int(BC))
print()
# Для удобства введем медианы AA1 BB1 CC1
# Тогда точки A1, B1 и C1 - являются серединами сторон BC, AC и AB
A1 = (((B[0] + C[0]) / 2), ((B[1] + C[1]) / 2))
B1 = (((A[0] + C[0]) / 2), ((A[1] + C[1]) / 2))
C1 = (((A[0] + B[0]) / 2), ((A[1] + B[1]) / 2))
AA1 = math.sqrt(((A1[0] - A[0]) ** 2) + ((A1[1] - A[1]) ** 2))
BB1 = math.sqrt(((B1[0] - B[0]) ** 2) + ((B1[1] - B[1]) ** 2))
CC1 = math.sqrt(((C1[0] - C[0]) ** 2) + ((C1[1] - C[1]) ** 2))
print("Длина медианы AA1", int(AA1),
      "\nДлина медианы BB1", int(BB1),
      "\nДлина медианы CC1", int(CC1))
# Рассчитаем высоты треугольника
print()
P = ((AB + AC + BC) / 2)
HA = ((2 * math.sqrt(P * (P - AB) * (P - AC) * (P - BC))) / AB)
HB = ((2 * math.sqrt(P * (P - AB) * (P - AC) * (P - BC))) / AC)
HC = ((2 * math.sqrt(P * (P - AB) * (P - AC) * (P - BC))) / BC)
print("Высота HA", int(HA), "\nВысота HB", int(HB), "\nВысота HC", int(HC))
